SMP_OnlineExchange/src/Catalogs/ПравилаКонвертацииСвойств/ПравилаКонвертацииСвойств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПравилаКонвертацииСвойств</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ПравилаКонвертацииОбъектов</owners>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.Свойства</types>
    </type>
  </attributes>
  <attributes>
    <name>Приемник</name>
    <type>
      <types>CatalogRef.Свойства</types>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяИсточника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПриемника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипИсточника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПриемника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидИсточника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПриемника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоКонвертации</name>
    <type>
      <types>CatalogRef.ПравилаКонвертацииОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПравилаКонвертации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучитьИзВходящихДанных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПередВыгрузкойСвойства</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПриВыгрузкеСвойства</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПослеВыгрузкиСвойства</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПередОбработкойВыгрузки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПослеОбработкиВыгрузки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Поиск</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отключить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеЗамещать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическиПриводитьЗначениеКДлинеПриемника</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПараметраДляПередачи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоискПоДатеНаРавенство</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьГруппуЧерезФайл</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПередЗагрузкойСвойства</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПослеЗагрузкиСвойства</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПриЗагрузкеСвойства</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

SMP_OnlineExchange/src/Enums/ТипыОбъектов/ТипыОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОбъектов</name>
  <enumValues>
    <name>БизнесПроцесс</name>
  </enumValues>
  <enumValues>
    <name>Булево</name>
  </enumValues>
  <enumValues>
    <name>ВидРасчета</name>
  </enumValues>
  <enumValues>
    <name>ВидСубконто</name>
  </enumValues>
  <enumValues>
    <name>Дата</name>
  </enumValues>
  <enumValues>
    <name>Документ</name>
  </enumValues>
  <enumValues>
    <name>Задача</name>
  </enumValues>
  <enumValues>
    <name>Календарь</name>
  </enumValues>
  <enumValues>
    <name>НаборКонстант</name>
  </enumValues>
  <enumValues>
    <name>Перечисление</name>
  </enumValues>
  <enumValues>
    <name>ПланВидовРасчета</name>
  </enumValues>
  <enumValues>
    <name>ПланВидовХарактеристик</name>
  </enumValues>
  <enumValues>
    <name>ПланОбмена</name>
  </enumValues>
  <enumValues>
    <name>ПланСчетов</name>
  </enumValues>
  <enumValues>
    <name>РегистрБухгалтерии</name>
  </enumValues>
  <enumValues>
    <name>РегистрНакопления</name>
  </enumValues>
  <enumValues>
    <name>РегистрРасчета</name>
  </enumValues>
  <enumValues>
    <name>РегистрСведений</name>
  </enumValues>
  <enumValues>
    <name>Справочник</name>
  </enumValues>
  <enumValues>
    <name>Строка</name>
  </enumValues>
  <enumValues>
    <name>ТочкаМаршрутаБизнесПроцесса</name>
  </enumValues>
  <enumValues>
    <name>УникальныйИдентификатор</name>
  </enumValues>
  <enumValues>
    <name>ХранилищеЗначения</name>
  </enumValues>
  <enumValues>
    <name>Число</name>
  </enumValues>
</mdclass:Enum>

SMP_OnlineExchange/src/Catalogs/ПравилаКонвертацииОбъектов/ПравилаКонвертацииОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПравилаКонвертацииОбъектов</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.СМП_УчетныеЗаписиОбменов</owners>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.Объекты</types>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приемник</name>
    <type>
      <types>CatalogRef.Объекты</types>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипИсточника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПриемника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПередВыгрузкойОбъекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПриВыгрузкеОбъекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПослеВыгрузкиОбъекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПередЗагрузкойОбъекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПриЗагрузкеОбъекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПослеЗагрузкиОбъекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НеЗамещать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеЗапоминатьВыгруженные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СинхронизироватьПоИдентификатору</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеВыгружатьОбъектыСвойствПоСсылкам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжитьПоискПоПолямПоискаЕслиПоИдентификаторуНеНашли</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПоследовательностьПолейПоиска</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НеСоздаватьОбъектВПриемникеЕслиНеНайденПоПолямПоиска</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьБыстрыйПоискПриЗагрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГенерироватьНовыйНомерИлиКодЕслиНеУказан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьОбъектТолькоПриНаличииНаНегоСсылки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриПереносеОбъектаПоСсылкеУстанавливатьТолькоGIUD</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетОбъектовОбмена</name>
    <type>
      <types>EnumRef.ПриоритетОбъектовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>НеЗамещатьОбъектСозданныйВИнформационнойБазеПриемнике</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПослеВыгрузкиОбъектаВФайлОбмена</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкаВариантовПоискаОбъектов</name>
    <attributes>
      <name>ИмяНастройкиДляАлгоритма</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяНастройкиДляПользователя</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеНастройкиДляПользователя</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SMP_OnlineExchange/src/Catalogs/ПравилаКонвертацииСвойств/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем мЗагрузкаДанных Экспорт;
Перем мУстанавливатьИмяИВидИсточникаПриемника Экспорт;

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Наименование = СМП_ОбщегоНазначения.глНаименованиеПКС(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ПометкаУдаления = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если мУстанавливатьИмяИВидИсточникаПриемника Тогда
		
		Если ЭтоНовый()
			ИЛИ Источник <> Ссылка.Источник Тогда
			
			ИмяИсточника = Строка(Источник);
			Если Не ПустаяСтрока(ИмяИсточника) Тогда
				
				ВидИсточника = XMLСтрока(Источник.Вид);
				Если Источник.Типы.Количество() = 1 Тогда
					ТипИсточника = Строка(Источник.Типы[0].Тип);
				КонецЕсли; 
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЭтоНовый()
			ИЛИ Приемник <> Ссылка.Приемник Тогда
			
			ИмяПриемника = Строка(Приемник);
			Если Не ПустаяСтрока(ИмяПриемника) Тогда
				
				ВидПриемника = XMLСтрока(Приемник.Вид);
				Если Приемник.Типы.Количество() = 1 Тогда
					ТипПриемника = Строка(Приемник.Типы[0].Тип);
				КонецЕсли; 
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПравилоКонвертации) Тогда
		ИмяПравилаКонвертации = "";
	Иначе
		ИмяПравилаКонвертации = СокрЛП(ПравилоКонвертации);
	КонецЕсли;
	
	Если НЕ мЗагрузкаДанных Тогда
		
		Наименование = СМП_ОбщегоНазначения.глНаименованиеПКС(ЭтотОбъект);
		
		Если Порядок = 0 Тогда
			Порядок = СМП_ОбщегоНазначения.ОчереднойПорядок("ПравилаКонвертацииСвойств", Родитель, Владелец);
		КонецЕсли;
		
		Если НЕ ЭтоГруппа Тогда
			
			Если ЭтоНовый() Тогда
				
				АвтоматическиУстановитьПриведениеНомераКДлинне();
				
			КонецЕсли;
			
			Если Поиск Тогда
				
				// поиск возможет только если объект приемник - ссылочного типа
				Если НЕ ЗначениеЗаполнено(ИмяПараметраДляПередачи)
					И НЕ СМП_ОбщегоНазначения.глЕстьСсылка(Владелец.Приемник) Тогда
					
					Поиск = Ложь;
					Сообщить("Поиск по полю отменен, так как объект для загрузки в применике не ссылочного типа.");
					
				КонецЕсли;
				
			Иначе
				
				ПоискПоДатеНаРавенство = Ложь;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура СгенерироватьУникальныйКод() Экспорт
	
	УстановитьНовыйКод();
	
КонецПроцедуры

Функция НайтиПравилаКО(Владелец, Источник, Приемник, ПрименитьНеЧеткийПоиск = Ложь) Экспорт

	НайденныеПКО  = Новый СписокЗначений;
	
	Если НЕ ПрименитьНеЧеткийПоиск Тогда
		
		Если Источник.Типы.Количество() <> 1
			ИЛИ Приемник.Типы.Количество() <> 1 Тогда
			
			Возврат НайденныеПКО;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ТипыИсточника = Новый СписокЗначений;
	ТипыПриемника = Новый СписокЗначений;

	Если НЕ Источник.Пустая() Тогда
		Для каждого Типы из Источник.Типы Цикл
			ТипыИсточника.Добавить(Типы.Тип);
		КонецЦикла;
	КонецЕсли;

	Если НЕ Приемник.Пустая() Тогда
		Для каждого Типы из Приемник.Типы Цикл
			ТипыПриемника.Добавить(Типы.Тип);
		КонецЦикла;
	Иначе
		Возврат НайденныеПКО;
	КонецЕсли;

	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Владелец",           Владелец);
	Запрос.УстановитьПараметр("ТипыИсточника",      ТипыИсточника);
	Запрос.УстановитьПараметр("ТипыПриемника",      ТипыПриемника);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПравилаКонвертацииОбъектов.Ссылка КАК ПКО
	|ИЗ
	|	Справочник.ПравилаКонвертацииОбъектов КАК ПравилаКонвертацииОбъектов
	|
	|ГДЕ
	|	ПравилаКонвертацииОбъектов.Владелец = &Владелец И
	|	ПравилаКонвертацииОбъектов.Приемник В(&ТипыПриемника)";

	Если ТипыИсточника.Количество() <> 0 Тогда
		Запрос.Текст = Запрос.Текст + "И ПравилаКонвертацииОбъектов.Источник В(&ТипыИсточника)";
	КонецЕсли;

	РезЗапроса = Запрос.Выполнить();

	РезТаблица = РезЗапроса.Выгрузить();

	Для каждого Строка из РезТаблица Цикл
		
		НайденныеПКО.Добавить(Строка.ПКО);
		
	КонецЦикла;

	Возврат НайденныеПКО;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОпределитьНужноПриведениеКСтрокеСправа()
	
	Если (НЕ (ИмяПриемника = "Код"
		ИЛИ ИмяПриемника = "Номер"))
		ИЛИ ИмяПриемника <> ИмяИсточника
		ИЛИ ТипИсточника <> ТипПриемника Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Если ИмяПриемника = "Код" Тогда
		
		Возврат	Приемник.Владелец.Тип = Перечисления.ТипыОбъектов.Справочник
		ИЛИ Приемник.Владелец.Тип = Перечисления.ТипыОбъектов.ПланВидовХарактеристик
		ИЛИ Приемник.Владелец.Тип = Перечисления.ТипыОбъектов.ПланВидовРасчета;
		
	ИначеЕсли ИмяПриемника = "Номер" Тогда
		
		Возврат Приемник.Владелец.Тип = Перечисления.ТипыОбъектов.Документ
		ИЛИ Приемник.Владелец.Тип = Перечисления.ТипыОбъектов.БизнесПроцесс
		ИЛИ Приемник.Владелец.Тип = Перечисления.ТипыОбъектов.Задача;
		
	КонецЕсли;			
	
	Возврат Ложь;		
	
КонецФункции

Процедура АвтоматическиУстановитьПриведениеНомераКДлинне()
	
	Если НЕ ЗначениеЗаполнено(Приемник)
		ИЛИ НЕ ЗначениеЗаполнено(Источник)
		ИЛИ Не ПустаяСтрока(АлгоритмПередВыгрузкойСвойства) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	// если код для справочника и номер для документа строковые и больший по длине номер переносится в меньший, то
	// номер берется справа, а не слева, как по умолчанию
	Если НЕ мЗагрузкаДанных
		И ОпределитьНужноПриведениеКСтрокеСправа()
		И Найти(ТипИсточника, "Строка") > 0
		И Найти(ТипПриемника, "Строка") > 0
		И Приемник.КвалификаторыСтроки_Длина <> 0
		И Источник.Владелец.Владелец.Приложение <> Перечисления.Приложения.Предприятие77
		И Источник.КвалификаторыСтроки_Длина <> Приемник.КвалификаторыСтроки_Длина Тогда
		
			АвтоматическиПриводитьЗначениеКДлинеПриемника = Истина;			
				
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область Инициализация

мУстанавливатьИмяИВидИсточникаПриемника = Истина;
мЗагрузкаДанных = Ложь;

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';uk='Неприпустимий виклик об`єкту на клієнті.'");
#КонецЕсли
